In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({"Name": ["Tom", "Mike", "Tiffany", "Varada", "Joel"],
                   "2018": [1, 3, 4, 5, 3],
                   "2019": [2, 4, 3, 2, 1],
                   "2020": [5, 2, 4, 4, 3]})
df

      Name  2018  2019  2020
0      Tom     1     2     5
1     Mike     3     4     2
2  Tiffany     4     3     4
3   Varada     5     2     4
4     Joel     3     1     3

In [3]:
df_melt=df.melt(id_vars="Name",
               var_name="Year",
               value_name="Courses")
df_melt

       Name  Year  Courses
0       Tom  2018        1
1      Mike  2018        3
2   Tiffany  2018        4
3    Varada  2018        5
4      Joel  2018        3
5       Tom  2019        2
6      Mike  2019        4
7   Tiffany  2019        3
8    Varada  2019        2
9      Joel  2019        1
10      Tom  2020        5
11     Mike  2020        2
12  Tiffany  2020        4
13   Varada  2020        4
14     Joel  2020        3

In [4]:
df_pivot=df_melt.pivot(index="Name",
                      columns="Year",
                      values="Courses")
df_pivot

Year     2018  2019  2020
Name
Joel        3     1     3
Mike        3     4     2
Tiffany     4     3     4
Tom         1     2     5
Varada      5     2     4

In [5]:
df_pivot=df_pivot.reset_index()
df_pivot.columns.name=None
df_pivot

      Name  2018  2019  2020
0     Joel     3     1     3
1     Mike     3     4     2
2  Tiffany     4     3     4
3      Tom     1     2     5
4   Varada     5     2     4

In [10]:
df = pd.DataFrame({"Name": ["Tom", "Tom", "Mike", "Mike"],
                   "Department": ["CS", "STATS", "CS", "STATS"], 
                   "2018": [1, 2, 3, 1],
                   "2019": [2, 3, 4, 2],
                   "2020": [5, 1, 2, 2]})
df

   Name Department  2018  2019  2020
0   Tom         CS     1     2     5
1   Tom      STATS     2     3     1
2  Mike         CS     3     4     2
3  Mike      STATS     1     2     2

In [11]:
df=df.melt(id_vars=["Name", "Department"],  # 녹여서 길게 #두개를 다 인덱스 id 변수처럼 쓴 것
            var_name="Year", 
            value_name="Courses")
df

    Name Department  Year  Courses
0    Tom         CS  2018        1
1    Tom      STATS  2018        2
2   Mike         CS  2018        3
3   Mike      STATS  2018        1
4    Tom         CS  2019        2
5    Tom      STATS  2019        3
6   Mike         CS  2019        4
7   Mike      STATS  2019        2
8    Tom         CS  2020        5
9    Tom      STATS  2020        1
10  Mike         CS  2020        2
11  Mike      STATS  2020        2

In [13]:
df=df.pivot_table(index="Name", columns='Year', values='Courses', aggfunc='sum')
df

Year  2018  2019  2020
Name
Mike     4     6     4
Tom      3     5     6

In [18]:
df1 = pd.DataFrame({'A': [1, 3, 5],
                    'B': [2, 4, 6]})
df2 = pd.DataFrame({'A': [7, 9, 11],
                    'B': [8, 10, 12]})

In [20]:
df1

   A  B
0  1  2
1  3  4
2  5  6

In [21]:
df2

    A   B
0   7   8
1   9  10
2  11  12

In [24]:
# 두 데이터프레임의 열이 동일하므로, 수직 병합 대상 
pd.concat((df1, df2), axis=0)  # axis=0 수직 병합

    A   B
0   1   2
1   3   4
2   5   6
0   7   8
1   9  10
2  11  12

In [27]:
pd.concat((df1, df2), 
          axis=1,
         ignore_index=True)

   0  1   2   3
0  1  2   7   8
1  3  4   9  10
2  5  6  11  12

In [28]:
pd.concat((df1, df2, df1, df2), axis=0, ignore_index=True)

     A   B
0    1   2
1    3   4
2    5   6
3    7   8
4    9  10
5   11  12
6    1   2
7    3   4
8    5   6
9    7   8
10   9  10
11  11  12

In [30]:
df1 = pd.DataFrame({"name": ['Magneto', 'Storm', 'Mystique', 'Batman', 'Joker', 'Catwoman', 'Hellboy'],
                    'alignment': ['bad', 'good', 'bad', 'good', 'bad', 'bad', 'good'],
                    'gender': ['male', 'female', 'female', 'male', 'male', 'female', 'male'],
                    'publisher': ['Marvel', 'Marvel', 'Marvel', 'DC', 'DC', 'DC', 'Dark Horse Comics']})
df2 = pd.DataFrame({'publisher': ['DC', 'Marvel', 'Image'],
                    'year_founded': [1934, 1939, 1992]})

In [31]:
df1

       name alignment  gender          publisher
0   Magneto       bad    male             Marvel
1     Storm      good  female             Marvel
2  Mystique       bad  female             Marvel
3    Batman      good    male                 DC
4     Joker       bad    male                 DC
5  Catwoman       bad  female                 DC
6   Hellboy      good    male  Dark Horse Comics

In [32]:
df2

  publisher  year_founded
0        DC          1934
1    Marvel          1939
2     Image          1992

In [33]:
pd.merge(df1, df2, how="inner", on="publisher")

       name alignment  gender publisher  year_founded
0   Magneto       bad    male    Marvel          1939
1     Storm      good  female    Marvel          1939
2  Mystique       bad  female    Marvel          1939
3    Batman      good    male        DC          1934
4     Joker       bad    male        DC          1934
5  Catwoman       bad  female        DC          1934

In [34]:
pd.merge(df1, df2, how="outer", on="publisher")

       name alignment  gender          publisher  year_founded
0   Magneto       bad    male             Marvel        1939.0
1     Storm      good  female             Marvel        1939.0
2  Mystique       bad  female             Marvel        1939.0
3    Batman      good    male                 DC        1934.0
4     Joker       bad    male                 DC        1934.0
5  Catwoman       bad  female                 DC        1934.0
6   Hellboy      good    male  Dark Horse Comics           NaN
7       NaN       NaN     NaN              Image        1992.0

In [35]:
pd.merge(df1, df2, how="left", on="publisher")

       name alignment  gender          publisher  year_founded
0   Magneto       bad    male             Marvel        1939.0
1     Storm      good  female             Marvel        1939.0
2  Mystique       bad  female             Marvel        1939.0
3    Batman      good    male                 DC        1934.0
4     Joker       bad    male                 DC        1934.0
5  Catwoman       bad  female                 DC        1934.0
6   Hellboy      good    male  Dark Horse Comics           NaN

In [36]:
pd.merge(df1, df2, how="right", on="publisher")

       name alignment  gender publisher  year_founded
0    Batman      good    male        DC          1934
1     Joker       bad    male        DC          1934
2  Catwoman       bad  female        DC          1934
3   Magneto       bad    male    Marvel          1939
4     Storm      good  female    Marvel          1939
5  Mystique       bad  female    Marvel          1939
6       NaN       NaN     NaN     Image          1992

In [39]:
import matplotlib.pyplot as plt        #차트를 위한 matplotlib 라이브러리
import seaborn as sns                  #seaborn의 별칭은 관례적으로 sns로 지정
sns.set(rc={'figure.figsize':(7,7)})    #그림 크기 저장, rc(runtime configuration)는 matplotlib 설정 객체

In [40]:
df

Year  2018  2019  2020
Name
Mike     4     6     4
Tom      3     5     6

In [42]:
print("ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ")

ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

In [43]:
x = np.array(['Tom', 'Mike', np.nan, 'Tiffany', 'Joel', 'Varada'])
[name.upper() for name in x]

['TOM', 'MIKE', 'NAN', 'TIFFANY', 'JOEL', 'VARADA']

In [44]:
x

array(['Tom', 'Mike', 'nan', 'Tiffany', 'Joel', 'Varada'], dtype='<U32')

In [45]:
s = pd.Series(x) #리스트 x를 판다스 시리즈로 변환
s

0        Tom
1       Mike
2        nan
3    Tiffany
4       Joel
5     Varada
dtype: object

In [46]:
s.str.upper() #'Series' / 'Index'의 str 속성을 통하여 접근 가능함, 원본 불변

0        TOM
1       MIKE
2        NAN
3    TIFFANY
4       JOEL
5     VARADA
dtype: object

In [47]:
s.str.split("ff", expand=True) #쪼개고, 데이터프레임으로 변환

        0     1
0     Tom  None
1    Mike  None
2     nan  None
3      Ti   any
4    Joel  None
5  Varada  None

In [49]:
s.str.split('a') #쪼개기만

0          [Tom]
1         [Mike]
2         [n, n]
3     [Tiff, ny]
4         [Joel]
5    [V, r, d, ]
dtype: object

In [50]:
df = pd.DataFrame(np.random.rand(5, 3),
                  columns = ['Measured Feature', 'recorded feature', 'PredictedFeature'],
                  index = [f"ROW{_}" for _ in range(5)])
df

      Measured Feature  recorded feature  PredictedFeature
ROW0          0.714750          0.059386          0.178655
ROW1          0.629736          0.875556          0.986036
ROW2          0.745406          0.263862          0.759916
ROW3          0.955483          0.275344          0.660173
ROW4          0.192275          0.806756          0.583494

In [51]:
df.columns.str.capitalize()

Index(['Measured feature', 'Recorded feature', 'Predictedfeature'], dtype='object')

In [52]:
df.columns.str.capitalize().str.replace("feature", "")  # 1~2 열에는 뒤에 공백이 포함되었음

Index(['Measured ', 'Recorded ', 'Predicted'], dtype='object')

In [53]:
df.columns.str.capitalize().str.replace("feature", "").str.strip() #앞뒤 공백 제거

Index(['Measured', 'Recorded', 'Predicted'], dtype='object')

In [54]:
df.columns = df.columns.str.capitalize().str.replace("feature", "").str.strip() #원본에 대입

In [55]:
df

      Measured  Recorded  Predicted
ROW0  0.714750  0.059386   0.178655
ROW1  0.629736  0.875556   0.986036
ROW2  0.745406  0.263862   0.759916
ROW3  0.955483  0.275344   0.660173
ROW4  0.192275  0.806756   0.583494

In [56]:
df.index

Index(['ROW0', 'ROW1', 'ROW2', 'ROW3', 'ROW4'], dtype='object')

In [57]:
df.index.str.lower()

Index(['row0', 'row1', 'row2', 'row3', 'row4'], dtype='object')

In [58]:
df.index.str.lower()

Index(['row0', 'row1', 'row2', 'row3', 'row4'], dtype='object')

In [59]:
df.index = df.index.str.lower().str.replace("w", "w_")

In [60]:
df

       Measured  Recorded  Predicted
row_0  0.714750  0.059386   0.178655
row_1  0.629736  0.875556   0.986036
row_2  0.745406  0.263862   0.759916
row_3  0.955483  0.275344   0.660173
row_4  0.192275  0.806756   0.583494

In [61]:
df = pd.DataFrame({'col1': ['replace me', 'b', 'c'],
                   'col2': [1, 99999, 3]})
df

         col1   col2
0  replace me      1
1           b  99999
2           c      3

In [62]:
df.replace({'replace me': 'a',
            99999: 2})

  col1  col2
0    a     1
1    b     2
2    c     3

In [63]:
s = pd.Series(['Tom', 'Mike', None, 'Tiffany', 'Joel', 'Varada'])
s

0        Tom
1       Mike
2       None
3    Tiffany
4       Joel
5     Varada
dtype: object

In [64]:
s.str.findall(r'^[^AEIOU].*[^aeiou]$')

0        [Tom]
1           []
2         None
3    [Tiffany]
4       [Joel]
5           []
dtype: object

In [67]:
from datetime import datetime, timedelta

In [68]:
now=datetime.now()  #datetime클래스가 제공하는 now() 메소드로 현재 시각 획득
now

datetime.datetime(2021, 10, 18, 23, 14, 21, 42864)

In [69]:
#strftime()은 날짜/시각을 문자열로 변환하는 메소드
(now,
now.strftime('%B'),   #달이름
now.strftime('%A'))   #요일이름

(datetime.datetime(2021, 10, 18, 23, 14, 21, 42864), 'October', 'Monday')

In [70]:
#timedelta()는 시간 간격을 처리하는 클래스
now + timedelta(days=1)    #하루 후 확인

datetime.datetime(2021, 10, 19, 23, 14, 21, 42864)